# -*- coding: utf-8 -*-

# =============================================================================
# 常見的格式與基本取值
# =============================================================================
import pandas as pd
a=[['a',1,1],['b',2,2],['c',3,3],['d',4,4]]
b=['a','b','c','d','e','f']
# =============================================================================
# DataFrame格式
# =============================================================================

c=pd.DataFrame(a)   #轉成DataFrame格式 
c.columns=['A欄','B欄','C欄']  #設定columns標題
c.set_index('A欄',inplace=True)  #設定index

print(c.loc['c'])          #找出index是c的
print('')
print(c.loc[['c','a']])    #找出index是c和a的
print('')
print(c.iloc[2])           #找出index位置是2的
print('')
print(c.iloc[2:4])         #找出index位置是2到3的
print('')
print(c.index)             #顯示有哪些索引
print('')
print(c.values)            #顯示有哪些資料
# =============================================================================
# Series格式 (二維陣列) loc&iloc 用法與DataFrame格式相同
# =============================================================================    
d=pd.Series(b)      #轉Series格式
print(d.index)      #顯示有哪些索引 RangeIndex(start=0, stop=6, step=1)
print('')
print(d.values)     #顯示有哪些資料 ['a' 'b' 'c' 'd' 'e' 'f']
