# -*- coding: utf-8 -*-
import numpy as np

# =============================================================================
# 基本陣列設定與屬性
# =============================================================================
array_int=np.arange(1,13).reshape(3,4) #產生1~12填滿的矩陣 然後切割成3列 4欄
array_z=np.zeros((3,5)) #3階每階5個 產生0填滿的陣列  np.ones 可產生1填滿的矩陣
array_np=np.array([[1,2,3],[1.1,2.2,3],[7,7,7],[9,8,7]],dtype=float)
array_np2=np.array([1,2,3,4,5,6,7,8,9])

print(array_np.ndim)  #顯示維度 2
print(array_np.dtype) #顯示資料類型 float64
print(array_np.shape) #顯示陣列形狀 (4,3)

# =============================================================================
# 亂數陣列
# =============================================================================
arrat_r1=np.random.rand(3,2)  #0~1的亂數 3階 每階2個
arrat_r2=np.random.randn(3,2) #常態分配亂數 3階 每階2個
arrat_r3=np.random.randint(1,3) #整數亂數 1~3 
arrat_r4=np.random.randint(1,9,(3,2)) #整數亂數 1~9  3階 每階2個

# =============================================================================
# 常用方法
# =============================================================================

print(array_np.mean()) #陣列的平均
print(array_np.sum())  #陣列的加總
print(array_np.max())  #陣列的最大
print(array_np.min()) #陣列的最小
print(array_np.std()) #陣列的標準差
print(np.median(array_np)) #陣列的中位數
print(np.var(array_np)) #陣列的變異數
