# -*- coding: utf-8 -*-


# =============================================================================
# map(function, iterable, ...)  map(函數, 可疊代對象)
# 不會改變原始對象，回傳處理結果為map物件須轉換
# =============================================================================

list_a=[1,2,3,4,5,6,7,8,9,10]

def square(n):
   return n**2


#以下三種結果一致
new_list1=list(map(square,[1,2,3,4,5,6,7,8,9,10])) #自訂函式,清單
new_list2=list(map(square,list_a))                 #自訂函式,清單物件
new_list3=list(map(lambda n:n**2,range(1,11)))     #匿名函式,range疊代器


# =============================================================================
# 常用作法
# =============================================================================
str_list=list(map(str,list_a))  #清單內容轉文字

num_list=list(map(eval,str_list)) #清單內容轉數值

